// <!-- ### დავალებები

// ### პროექტი 35 - Blood Alcohol Calculator - სისხლში ალკოჰოლის შემცველობის კალკულატორი

// ზოგჯერ ჩახლართული გამოთვლები გვჭირდება, რომელიც არაერთი მოწოდებული მონაცემის საფუძველზე სრულდება და შედეგს სწორედ ასე ვიღებთ. 
// შექმენით პროგრამა, რომელიც მოგთხოვთ თქვენს წონას, სქესს, ჭიქების რაოდენობას, 
// დალეული სასმელის მოცულობის მიხედვით ალკოჰოლის რაოდენობას და ბოლო ჭიქის მიღების შემდეგ გასული დროის მონაკვეთს. 
// გამოთვალეთ თქვენს სისხლში ალკოჰოლის შემცველობა (BAC) შემდეგი ფორმულის გამოყენებით:

// BAC = (A × 5.14 / W × r) − .015 × H

// სადაც:

// - A არის მთლიანი მოხმარებული ალკოჰოლი, უნციაში (oz).
// - W არის სხეულის წონა ფუნტებში.
// - r არის ალკოჰოლის განაწილების თანაფარდობა:
//   – 0,73 მამაკაცებისთვის
//   – 0,66 ქალებისთვის
// - H არის გასული საათების რაოდენობა ბოლო ჭიქის დალევის მერე.

// პროგრამამ უნდა დაბეჭდოს, შეიძლება თუ არა ავტომობილის მართვა, სისხლში ალკოჰოლის შემცველობის 0,08-სთან შედარებით.

// Example Output

// ```shell
// < Your BAC is 0.08
// < It is not legal for you to drive.
// ``` -->



let Aweight = 80;
let Rsex = {
    male: 0.73,
    female: 0.66
}
let glass = 2;

let AdrinkGlasses = 5;
let HlastDrink = 2;


let bac  = function(){
    return((AdrinkGlasses * 5.14 / Aweight * Rsex.female) - 0.015 * HlastDrink);
}
console.log(bac());
